Single_particle_bubble/CFD/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    outlet
    {
        type            patch;
        nFaces          12;
        startFace       2132;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          536;
        startFace       2144;
    }
    inlet
    {
        type            patch;
        nFaces          12;
        startFace       2680;
    }
)

// ************************************************************************* //
